app/controllers/work_units_controller.rb

SELECT "work_units".* FROM "work_units" WHERE "work_units"."id" = 1 LIMIT 1
---
  def show
    @work_unit = WorkUnit.find params[:id]

INSERT INTO "work_units" ("description", "created_at", "updated_at", "user_id", "number_of_units") VALUES ('Finished this application', '2011-08-21 00:00:00.000000', '2011-08-21 16:59:44.178290', 2, 4)
---
  def create
    @work_unit = WorkUnit.new params[:work_unit]
    @work_unit.user = current_user
    if @work_unit.save

SELECT "work_units".* FROM "work_units" WHERE "work_units"."id" = 11 LIMIT 1
---
  def edit
    @work_unit = WorkUnit.find params[:id]

SELECT "work_units".* FROM "work_units" WHERE "work_units"."id" = 11 LIMIT 1
UPDATE "work_units" SET "created_at" = '2011-08-17 00:00:00.000000', "updated_at" = '2011-08-21 09:16:04.654814' WHERE "work_units"."id" = 11
---
  def update
    @work_unit = WorkUnit.find params[:id]
    if @work_unit.update_attributes params[:work_unit]

SELECT "work_units".* FROM "work_units" WHERE "work_units"."id" = 16 LIMIT 1
DELETE FROM "work_units" WHERE "work_units"."id" = 16
---
  def destroy
    @work_unit = WorkUnit.find params[:id]
    if @work_unit.destroy